app/views/generalmember/index.html.erb

      <%= label_tag("Sort by:") %>
      <%= select_tag(:sort, options_for_select(Member.SORTS_ALL.map { |s| [s[:name], s[:id]] }, params[:sort]), :onchange => ("this.form.submit();")) %>
---
SELECT "members".* FROM "members" ORDER BY "members"."id" ASC