app/views/events/edit.html.erb


  <%= form_for(Event.find(params[:id])) do |f| %>
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]