app/views/events/show.html.erb

        <% else %>
        <%= form_for(Event.find(params[:id])) do |f| %>
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]