app/controllers/access_controller.rb

SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."username" = $1 ORDER BY "admin_users"."id" ASC LIMIT $2  [["username", "test"], ["LIMIT", 1]]
---
  def attempt_login
    if params[:username].present? && params[:password].present?
      #this should sanitize our data for us
      found_user = AdminUser.where(:username => params[:username]).first