app/controllers/admin_users_controller.rb

INSERT INTO "admin_users" ("first_name", "last_name", "email", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @admin_user = AdminUser.new(admin_user_params)
    if @admin_user.save