app/controllers/events_controller.rb

  def index
    @events = Event.order(:id)
---
SELECT "events".* FROM "events" ORDER BY "events"."id" ASC

  def create
    @events = Event.new(event_params)
    if @events.save
---
INSERT INTO "events" ("title", "date", "semester", "points_worth", "created_at", "updated_at", "mapped_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asd"], ["date", "2020-11-12"], ["semester", "Spring"], ["points_worth", 5], ["created_at", "2020-11-03 20:15:33.076225"], ["updated_at", "2020-11-03 20:15:33.076225"], ["mapped_id", -1]]

  def edit
    @events = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @events = Event.find(params[:id])
    if @events.update_attributes(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "semester" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["semester", "Fall"], ["updated_at", "2020-11-03 20:04:11.798070"], ["id", 1]]