app/controllers/generalmember_controller.rb

  def index
    @members = Member.order(:id)
---
SELECT "members".* FROM "members" ORDER BY "members"."id" ASC