app/controllers/members_controller.rb

SELECT "members".* FROM "members" WHERE (first_name ILIKE '%s%' OR last_name ILIKE '%s%' OR email ILIKE '%s%') ORDER BY total_points DESC
---
  def index
    @members = Member.all

INSERT INTO "members" ("first_name", "last_name", "email", "fall_points", "spring_points", "total_points", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @member = Member.new(member_params)
    if @member.save

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "fall_points" = $1, "spring_points" = $2, "total_points" = $3, "updated_at" = $4 WHERE "members"."id" = $5  [["fall_points", 10], ["spring_points", 20], ["total_points", 30], ["updated_at", "2020-10-25 21:35:08.742889"], ["id", 19]]
---
  def update
    @member = Member.find(params[:id])
    if @member.update_attributes(member_params)

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def delete
    @member = Member.find(params[:id])

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 18]]
---
  def destroy
    @member = Member.find(params[:id])
    @member.destroy

SELECT "members".* FROM "members" ORDER BY "members"."id" ASC
---
  def reset
    @members = Member.all

DELETE FROM "members"
---
  def reset_members
    Member.delete_all

INSERT INTO "members" ("first_name", "last_name", "email", "fall_points", "spring_points", "total_points", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def export
    file = "#{Rails.root}/public/PAIDMemberData.csv"


    table = Member.all;0
    wanted_columns = [:id, :first_name, :last_name, :email, :fall_points, :spring_points, :total_points ]

    columns = %w(id first_name last_name email fall_points spring_points total_points)
    CSV.open( file, 'w' ) do |writer|
      writer << wanted_columns
      #columns(&:humanize)
      #table.first.attributes.map { |a,v| a }
      table.each do |s|
        writer << s.attributes.values_at(*columns)