app/models/event.rb

SELECT 1 AS one FROM "events" WHERE "events"."mapped_id" = $1 LIMIT $2  [["mapped_id", 9], ["LIMIT", 1]]
INSERT INTO "events" ("title", "points_worth", "created_at", "updated_at", "mapped_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Event Ongoing"], ["points_worth", 2], ["created_at", "2020-11-03 19:09:05.306033"], ["updated_at", "2020-11-03 19:09:05.306033"], ["mapped_id", 9]]
---
  def self.apiEvents()
    r = RestClient.new
    result = r.events()
    response = JSON.parse(result.body)
    response["events"].each do |mapped_event|
      if !Event.where(mapped_id: mapped_event["id"]).exists?
        e = Event.create(
          :mapped_id=>  mapped_event["id"],
          :points_worth => mapped_event["points"],
          :title => mapped_event["name"],
          :date => mapped_event["date"]
        )