app/models/member.rb

  def self.import(file, points, id, semester)
    data = []
    event = Event.find(id)
    CSV.foreach(file.path, headers: true) do |row|
      member = Member.find_by(email: row['email'])
      if member
        if semester == 'Fall'
          member.update_attribute(:fall_points, points.to_i + member.fall_points)
        else
          member.update_attribute(:spring_points, points.to_i + member.spring_points)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "maitreyiramaswamy@gmail.com"], ["LIMIT", 1]]
UPDATE "members" SET "spring_points" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["spring_points", 10], ["updated_at", "2020-10-17 20:35:14.623085"], ["id", 5]]
UPDATE "members" SET "total_points" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["total_points", 20], ["updated_at", "2020-10-17 20:34:40.018483"], ["id", 5]]

  def self.api(id,semester)
    r = RestClient.new
    # semester = semester
    result = r.event(id)
    v = JSON.parse(result.body)
    points = v["points"].to_i
    data = []
    event = Event.find_by(mapped_id: 9)
      v["sign_ins"].each do |row|
        member = Member.find_by(email: row['email'])
        if member
          if semester == 'Fall'
            member.update_attribute(:fall_points, points.to_i + member.fall_points)
          else
            member.update_attribute(:spring_points, points.to_i + member.spring_points)
          end
          member.update_attribute(:total_points, member.fall_points + member.spring_points)
---
SELECT "events".* FROM "events" WHERE "events"."mapped_id" = $1 LIMIT $2  [["mapped_id", 9], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "jack@tamu.edu"], ["LIMIT", 1]]
UPDATE "members" SET "fall_points" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["fall_points", 2], ["updated_at", "2020-11-03 20:28:30.682852"], ["id", 1]]
UPDATE "members" SET "spring_points" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["spring_points", 2], ["updated_at", "2020-11-03 19:46:15.686313"], ["id", 1]]
UPDATE "members" SET "total_points" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["total_points", 2], ["updated_at", "2020-11-03 19:46:15.693224"], ["id", 1]]