app/views/members/show.html.erb

SELECT "events"."id" FROM "events" INNER JOIN "events_members" ON "events"."id" = "events_members"."event_id" WHERE "events_members"."member_id" = $1  [["member_id", 1]]
---
    <th>Events Attended</th>
     <% Event.find(@member.event_ids).each do |event| %>